---
kind: method
id: M:Autodesk.Revit.DB.WorksetConfiguration.Dispose
source: html/040f87de-fda8-289a-16af-03d57e08fdfc.htm
---
# Autodesk.Revit.DB.WorksetConfiguration.Dispose Method

Releases all resources used by the WorksetConfiguration

## Syntax (C#)
```csharp
public void Dispose()
```